% b为输出单个因素隶属度矩阵，a为输入监测数据（单个），dd为监测数据类型，1-9参考李明论文分类评价指标类别。
%%  李明论文分类
% 评价指标 D C B A
% 衬砌裂缝宽度u11(mm) 0～0.2 0.2～0.3 0.3～0.5 >0.5
% 衬砌收敛变形u12 (‰D) 0～5 5～8 8～10 >10
% 衬砌结构位移速率u13（mm/年） 0～1 1～3 3～10 >10
% 纵向不均匀沉降u14 (mm) 0～20 20～30 30～40 >40
% 渗漏水程度u21 0～0.25 0.250～0.5 0.50～0.75 0.750～1.0
% 渗漏水PH 值u22 >6 5～6 4～5 <4
% 管片接缝宽度u23 (mm) 0～2 2～4 4～6 >6
% 衬砌表面剥落u31 (mm) 0～50 50～75 75～150 >150
% 衬砌保护层厚度比u32 0.95～1 0.85～0.95 0.70～0.85 0～0.7
%% 若评价指标小于以上各指标D的mean(D)，f(x)=1，若评价指标大于以上各指标A的mean(A)， f(x)=1；渗漏水PH值则相反。
function [b]=fenji(a,dd)
    b=zeros(1,4); % 监测数据预警值  1,2,3,4代表隶属等级A-D，隶属等级和健康评级是相反的，健康评级是D-A
    load membershipparameter.mat
    switch dd   %以下语句为了比较清楚表明哪种dd是哪种因素；其实就程序来讲没有必要
        case 1 % 衬砌裂缝宽度
            for i=1:4
                b(i)=exp(-((a-u(dd,i,1))/u(dd,i,2))^2);
            end
        case 2 % 衬砌收敛变形
            for i=1:4
                b(i)=exp(-((a-u(dd,i,1))/u(dd,i,2))^2);
            end
        case 3 % 衬砌结构位移速率
            for i=1:4
                b(i)=exp(-((a-u(dd,i,1))/u(dd,i,2))^2);
            end
        case 4 % 纵向不均匀沉降
            for i=1:4
                b(i)=exp(-((a-u(dd,i,1))/u(dd,i,2))^2);
            end
        case {5} % 渗漏水程度
            for i=1:4
                b(i)=exp(-((a-u(dd,i,1))/u(dd,i,2))^2);
            end
        case {6} % 渗漏水PH值
            for i=1:4
                b(i)=exp(-((a-u(dd,i,1))/u(dd,i,2))^2);
            end
        case {7} % 管片接缝宽度
            for i=1:4
                b(i)=exp(-((a-u(dd,i,1))/u(dd,i,2))^2);
            end
        case {8} % 衬砌表面剥落
            for i=1:4
                b(i)=exp(-((a-u(dd,i,1))/u(dd,i,2))^2);
            end
        case {9} % 衬砌保护层厚度比
            for i=1:4
                b(i)=exp(-((a-u(dd,i,1))/u(dd,i,2))^2);
            end
    end
end

% 用于分级
%% 王华牢分类
% L1 sc (mm ) ( 0, 60] ( 60, 120] ( 120, 160] ( 160, ) )累积沉降值
% L2 sd (mm /100m ) ( 0, 20] ( 20, 40] ( 40, 60] (60, ) )差异沉降至裂缝张开
% L3 xz (mm ) ( 0, 2] ( 2, 5] (5, 9] ( 9, ) )环向接缝宽度
% L4 xh (mm ) ( 0, 2] ( 2, 5] (5, 9] ( 9, ) )纵向接缝宽度
% L5 xz (mm ) ( 0, 5] ( 5, 8] ( 8, 12] (12, ) )环向错台
% L6 xh (mm ) ( 0, 5] ( 5, 8] ( 8, 12] (12, ) )径向错台
% L7 xz (mm ) ( 0, 2] ( 2, 4] (4, 5] ( 5, ) )纵缝错齿量值
% L8 xh (mm ) ( 0, 2] ( 2, 6] (6, 9] ( 9, ) )环缝错齿量值
% L9 e ((D) ( 0, 5] ( 5, 8] ( 8, 10] (10, ) )直径椭圆度变形
% L10 pt ( 0, 0. 65] (0. 65, 0. 75] ( 0. 75, 0. 8] ( 0. 8, 1)拱顶水土压力过大
% L11 ps ( 0, 0. 65] (0. 65, 0. 75] ( 0. 75, 0. 8] ( 0. 8, 1)两侧水土压力过大
% L12 pb ( 0, 0. 65] (0. 65, 0. 75] ( 0. 75, 0. 8] ( 0. 8, 1)底部水土压力过大
% L13 sigmas (MPa) (0, 218] ( 218, 245] ( 245, 280] ( 280, ) )内外钢筋应力差值
% L14 sigma( 0, 0. 67] ( 0. 67, 0. 8] ( 0. 8, 1] ( 1, ) )螺栓应力过大
% M1 ca (m? mm ) ( 0, 0. 088] ( 0. 088, 0. 33] ( 0. 33, 0. 66] ( 0. 66, ) )裂缝长度及宽度
% M2 cdd ( 0, 2] ( 2, 3. 5] ( 3. 5, 5] ( 5, ) )裂缝密度及数量
% M3 ba (mm2 ) (0, 200] ( 200, 440] ( 440, 1760] ( 1760, ) )剥离区域大小
% M4 bd (mm ) ( 0, 6] ( 6, 12] ( 12, 25] (25, ) )剥离区域深度
% M5 de (0, 0.1] ( 0. 1, 0. 2] ( 0. 2, 0. 3] ( 0. 3, 1)衬砌强度降低比值
% M6 m ( 0, 0. 05] (0. 05, 0. 08] ( 0. 08, 0. 10] ( 0. 10, 1)断面损失率
% S1 sw ( 0, 1] ( 1, 3] (3, 7] ( 7, ) )每100平米渗漏点
% S2 sm (0, 0. 1] ( 0. 1, 0. 2] ( 0. 2, 0. 3] ( 0. 3, ) )单点浸湿面积
% S3 sph (6, 8] ( 5, 6] (4,5] ( 0,4) )PH值


%%
%王华劳分级代码如下
% a=1:10; % 监测数据
% sl=length(a);
% b(1:sl)=0; % % 监测数据预警值  1,2,3,4代表隶属等级A-D，隶属等级和健康评级是相反的，健康评级是D-A
% for i=1:10  % 求预警值
%     switch i
%         case 1 % 累积沉降值
%         if a(i)>0 && a(i)<60
%             b(i)=1;
%         elseif a(i)>=60 && a(i)<120
%             b(i)=2;
%         elseif a(i)>=120 && a(i)<160
%             b(i)=3;
%         else
%             b(i)=4;
%         end
%         case 2 % 差异沉降
%         if a(i)>0 && a(i)<20
%             b(i)=1;
%         elseif a(i)>=20 && a(i)<40
%             b(i)=2;
%         elseif a(i)>=40 && a(i)<60
%             b(i)=3;
%         else
%             b(i)=4;
%         end
%         case {3,4} % 环向‘纵向接缝宽度
%         if a(i)>0 && a(i)<2
%             b(i)=1;
%         elseif a(i)>=2 && a(i)<5
%             b(i)=2;
%         elseif a(i)>=5 && a(i)<9
%             b(i)=3;
%         else
%             b(i)=4;
%         end
%         case {5,6} % 环向‘纵向接缝宽度
%         if a(i)>0 && a(i)<5
%             b(i)=1;
%         elseif a(i)>=5 && a(i)<8
%             b(i)=2;
%         elseif a(i)>=8 && a(i)<12
%             b(i)=3;
%         else
%             b(i)=4;
%         end
%         case {7} % 纵缝错齿量值
%         if a(i)>0 && a(i)<2
%             b(i)=1;
%         elseif a(i)>=2 && a(i)<4
%             b(i)=2;
%         elseif a(i)>=4 && a(i)<5
%             b(i)=3;
%         else
%             b(i)=4;
%         end
%         case {8} % 环缝错齿量值
%         if a(i)>0 && a(i)<2
%             b(i)=1;
%         elseif a(i)>=2 && a(i)<6
%             b(i)=2;
%         elseif a(i)>=6 && a(i)<9
%             b(i)=3;
%         else
%             b(i)=4;
%         end
%         case {9} % 椭圆度变形
%         if a(i)>0 && a(i)<0.005
%             b(i)=1;
%         elseif a(i)>=0.005 && a(i)<0.008
%             b(i)=2;
%         elseif a(i)>=0.008 && a(i)<0.01
%             b(i)=3;
%         else
%             b(i)=4;
%         end
%         case {10} % PH
%         if a(i)>=6 && a(i)<8
%             b(i)=1;
%         elseif a(i)>=5 && a(i)<6
%             b(i)=2;
%         elseif a(i)>=4 && a(i)<5
%             b(i)=3;
%         else
%             b(i)=4;
%         end
%     end
% end
    

%%
