% 隶属度求解 点击ctrl+R，注释程序；可多次点击，多次注释同一次选中的代码；点击ctrl+T，取消注释程序。
%%
% 衬砌裂缝宽度u11(mm) 0～0.2 0.2～0.3 0.3～0.5 >0.5
% 衬砌收敛变形u12 (‰D) 0～5 5～8 8～10 >10
% 衬砌结构位移速率u13（mm/年） 0～1 1～3 3～10 >10
% 纵向不均匀沉降u14 (mm) 0～20 20～30 30～40 >40
% 渗漏水程度u21 0～0.25 0.250～0.5 0.50～0.75 0.750～1.0
% 渗漏水PH 值u22 >6 5～6 4～5 <4
% 管片接缝宽度u23 (mm) 0～2 2～4 4～6 >6
% 衬砌表面剥落u31 (mm) 0～50 50～75 75～150 >150
% 衬砌保护层厚度比u32 0.95～1 0.85～0.95 0.70～0.85 0～0.7
%%
clear
% u(1,1,1)=0.1;  % u(i,j,k) i代表注释中几个监测量；j代表隶属等级，1-4分别是A-D，k代表x0和c
% u(1,1,2)=0.12;
% u(1,2,1)=0.25;
% u(1,2,2)=0.06;
% u(1,3,1)=0.4;
% u(1,3,2)=0.12;
% u(1,4,1)=0.75;
% u(1,4,2)=0.3;
% u(2,1,1)=2.5;
% u(2,1,2)=3;
% u(2,2,1)=6.5;
% u(2,2,2)=1.81;
% u(2,3,1)=9;
% u(2,3,2)=1.2;
% u(2,4,1)=15;
% u(2,4,2)=6;
% u(3,1,1)=0.5;
% u(3,1,2)=0.6;
% u(3,2,1)=2;
% u(3,2,2)=1.2;
% u(3,3,1)=6.5;
% u(3,3,2)=4.22;
% u(3,4,1)=15;
% u(3,4,2)=6;
% u(4,1,1)=10;
% u(4,1,2)=12.05;
% u(4,2,1)=25;
% u(4,2,2)=6;
% u(4,3,1)=35;
% u(4,3,2)=6;
% u(4,4,1)=60;
% u(4,4,2)=24.1;
% u(5,1,1)=0.125;
% u(5,1,2)=0.15;
% u(5,2,1)=0.375;
% u(5,2,2)=0.15;
% u(5,3,1)=0.625;
% u(5,3,2)=0.15;
% u(5,4,1)=0.875;
% u(5,4,2)=0.15;
% u(6,1,1)=9;
% u(6,1,2)=3.61;
% u(6,2,1)=5.5;
% u(6,2,2)=0.6;
% u(6,3,1)=4.5;
% u(6,3,2)=0.6;
% u(6,4,1)=2;
% u(6,4,2)=2.41;
% u(7,1,1)=1;
% u(7,1,2)=1.21;
% u(7,2,1)=3;
% u(7,2,2)=1.21;
% u(7,3,1)=5;
% u(7,3,2)=1.21;
% u(7,4,1)=9;
% u(7,4,2)=3.61;
% u(8,1,1)=25;
% u(8,1,2)=30.12;
% u(8,2,1)=62.5;
% u(8,2,2)=15.06;
% u(8,3,1)=112.5;
% u(8,3,2)=45.18;
% u(8,4,1)=225;
% u(8,4,2)=90.36;
% u(9,1,1)=0.975;
% u(9,1,2)=0.03;
% u(9,2,1)=0.9;
% u(9,2,2)=0.06;
% u(9,3,1)=0.775;
% u(9,3,2)=0.09;
% u(9,4,1)=0.35;
% u(9,4,2)=0.42;
% save('membershipparameter.mat','u');
%%
load membershipparameter.mat  %此文件中变量为u，以下不能用u作为变量
cdata=zeros(9,1); % 原始数据
rover=zeros(1,4); %原始单个数据隶属度分级a-d
R=zeros(9,4);  % 隶属度函数矩阵,单因素评判集构成模糊矩阵R
importantmat=[5,2,7,1,4,8,9,3,6]; % 重要度指标
for i=1:9
    cdata(i,:)=2*u(i,3,1)*rand(1,1);
end
for i=1:9 % i代表第几个评价指标
    for j=1:1 % j代表i指标下的那个数据，一个时间点一个数据
        rover=fenji(cdata(i,j),i); 
        R(i,:)=rover; % 此函数中为9个因素评判集构成模糊矩阵R，每行依次为各评价指标DBCA四个等级的关联度。
%         x0=u(i,rover(i,j),1);
%         c=u(i,rover(i,j),2);
%         R(i,j)=exp(-((cdata(i,j)-x0)/c)^2);
    end
end
W=indexweight(importantmat);
W=W';
B=W*R; % 最终分级结果，依次为DBCA四个等级的关联度，数值最大的那个为分级结果。
if max(B)==B(1)
    fprintf('健康等级为D\n')
elseif max(B)==B(2)
    fprintf('健康等级为C\n')
elseif max(B)==B(3)
    fprintf('健康等级为B\n')
elseif max(B)==B(4)
    fprintf('健康等级为A\n')    
end